Дошкольное_учреждение83/src/Catalogs/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Файлы</name>
  <comment>Файлы в папках</comment>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <comment>Владелец файла</comment>
    <type>
      <types>BusinessProcessRef.Задание</types>
      <types>CatalogRef.ПапкиФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйФайл</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <comment>Дата заема на редактирование</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <comment>Файл зашифрован</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭЦП</name>
    <comment>Файл подписан ЭЦП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <comment>Полное наименование (длиной до 256 символов)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <comment>Пользователь, занявший файл для редактирования</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсия</name>
    <comment>Активная версия</comment>
    <type>
      <types>CatalogRef.ВерсииФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияАвтор</name>
    <comment>Автор - пользователь, создавший версию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаМодификацииФайла</name>
    <comment>Дата модификации файла - в локальном времени</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияДатаСоздания</name>
    <comment>Дата создания версии</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияКод</name>
    <comment>Текущая версия код</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияНомерВерсии</name>
    <comment>Номер версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРазмер</name>
    <comment>Размер файла версии</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияРасширение</name>
    <comment>Расширение файла версии</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяВерсияТом</name>
    <comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <comment>Двоичные данные сертификата</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/CommonModules/РаботаСБизнесПроцессамиКлиент/Module.bsl
// Выполняет проверки перед стартом бизнес-процесса
Процедура ПередСтартомБизнесПроцесса(Объект, Отказ) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Предмет) Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ДелопроизводствоКлиентСервер.ЭтоСсылкаНаДокумент(Объект.Предмет) Тогда 
		
		ЗанятыеФайлы = РаботаСФайлами.ПолучитьЗанятыеФайлы(Объект.Предмет);
		Если ЗанятыеФайлы.Количество() > 0 Тогда 
			
			ПараметрыФормы = Новый Структура;	
			ПараметрыФормы.Вставить("СообщениеВопрос", 		НСТР("ru = 'Выполнить запуск бизнес-процесса?'"));
			ПараметрыФормы.Вставить("СообщениеЗаголовок", 	НСТР("ru = 'Следующие файлы приложенного документа заняты для редактирования:'"));
			ПараметрыФормы.Вставить("Заголовок", 			НСТР("ru = 'Запуск бизнес-процесса'"));
			ПараметрыФормы.Вставить("ВладелецФайла", 		Объект.Предмет);
			
			Результат = ОткрытьФормуМодально("Справочник.Файлы.Форма.СписокЗанятыхСВопросом", ПараметрыФормы);
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.Файлы") Тогда 
		
		Редактирует = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Предмет, "Редактирует");
		Если Не Редактирует.Пустая() Тогда 
			
			ТекстВопроса = НСТР("ru = 'Приложенный файл занят для редактирования. Выполнить запуск бизнес-процесса?'");
			Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСТР("ru = 'Запуск бизнес-процесса'"));
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

// Выполняет открытие карточки "Исполнителя", если он установлен
Процедура ОткрытьИсполнителя(Исполнитель) Экспорт
	
	Если Не Исполнитель.Пустая() Тогда
		ОткрытьЗначение(Исполнитель);
	КонецЕсли;	
	
КонецПроцедуры

Функция ПроверитьНаличиеЗанятыхФайлов(Объект) Экспорт
	
	Если Не ЗначениеЗаполнено(Объект.Предмет) Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	ТекущийПользователь = РаботаСФайламиКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ТекущийПользователь;
	
	Если ДелопроизводствоКлиентСервер.ЭтоСсылкаНаДокумент(Объект.Предмет) Тогда 
		
		ЗанятыеФайлы = РаботаСФайлами.ПолучитьЗанятыеФайлы(Объект.Предмет, ТекущийПользователь);
		Если ЗанятыеФайлы.Количество() > 0 Тогда 
			
			ПараметрыФормы = Новый Структура;	
			ПараметрыФормы.Вставить("СообщениеВопрос", 		НСТР("ru = 'Выполнить задачу?'"));
			ПараметрыФормы.Вставить("СообщениеЗаголовок", 	НСТР("ru = 'Следующие файлы приложенного документа заняты вами для редактирования:'"));
			ПараметрыФормы.Вставить("Заголовок", 			НСТР("ru = 'Выполнение задачи'"));
			ПараметрыФормы.Вставить("ВладелецФайла", 		Объект.Предмет);
			ПараметрыФормы.Вставить("Редактирует", 			ТекущийПользователь);
			
			Результат = ОткрытьФормуМодально("Справочник.Файлы.Форма.СписокЗанятыхСВопросом", ПараметрыФормы);
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Отказ = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Объект.Предмет) = Тип("СправочникСсылка.Файлы") Тогда 
		
		Редактирует = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Предмет, "Редактирует");
		Если Редактирует = ТекущийПользователь Тогда 
			
			ТекстВопроса = НСТР("ru = 'Приложенный файл занят вами для редактирования. Выполнить задачу?'");
			Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСТР("ru = 'Выполнение задачи'"));
			Если Результат <> КодВозвратаДиалога.Да Тогда 
				Возврат Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
